# -*- coding: utf8 -*-
Address_Type = {
    'no': [0, 1, 2, 3, 4, 5],
    'name': [u'其他类型', u'保留IP', u'院系办公', u'无线用户', u'教工住宅', u'学生宿舍']
}

User_Type = {
    'no': [1, 2, 3, 4, 11, 12, 13,
           21, 22, 26, 27, 29,
           31, 32, 36, 37, 39,
           8, 28, 38, 40, 41, 42, 43,
           50, 51, 52, 53, 54, 55, 56, 57, 58, 59,
           99, 98, 97, 96, 94, 88, 72, 71, 67, 66, 62, 61],
    'name': [u'学校本部', u'二学位', u'协和', u'临时', u'交换生', u'香港二学位', u'旁听生',
             u'硕士研究生', u'非学历教育专业学位', u'同等学力硕士生', u'港澳台硕士生', u'其他硕士',
             u'博士研究生', u'专业学位', u'同等学力博士生', u'港澳台博士生', u'其他博士',
             u'本科留学生', u'硕士留学生', u'博士留学生', u'普通进修留学生', u'高级进修留学生', u'留学研究学者', u'留学语言生',
             u'远程教育专升本学员', u'远程教育专升本学员', u'美术学院成人教育学生', u'远程教育研究生课程进修学员', u'远程教育研究生课程进修学员', u'远程教育研究生课程进修学员', u'远程教育研究生课程进修学员', u'培训项目学员', u'培训项目学员', u'培训项目学员',
             u'正式事业编制', u'人事代理事业编制', u'深圳研究生院聘的深圳事业编制', u'流动事业编制', u'酒仙桥医院事业编制', u'玉泉医院事业编制', u'企业编制', u'大集体人员', u'农转工人员', u'企业博士后', u'博士后', u'临时员工']
}

Query_Type = {
    'name': [u'操作系统', u'操作系统版本', u'上网时间', u'时长']
}

Divide_Type = {
    'value': ['None', 'create_year', 'user_type', 'faculty', 'address_type'],
    'name': [u'无', u'创建年份', u'用户类型', u'院系', u'IP地址类型']
}
